Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/spi_ixs.h
/* -------- SPI_IXS_BRG : (SPI_IXS Offset: 0x2C) (R/W 32) SPI Baud Rate Register -------- */
#define SPI_IXS_BRG_RESETVALUE                _UINT32_(0x00)                                       /*  (SPI_IXS_BRG) SPI Baud Rate Register  Reset Value */

#define SPI_IXS_BRG_BRG_Pos                   _UINT32_(0)                                          /* (SPI_IXS_BRG) Baud Rate Divisor bits Position */
#define SPI_IXS_BRG_BRG_Msk                   (_UINT32_(0x1FFF) << SPI_IXS_BRG_BRG_Pos)            /* (SPI_IXS_BRG) Baud Rate Divisor bits Mask */
#define SPI_IXS_BRG_BRG(value)                (SPI_IXS_BRG_BRG_Msk & (_UINT32_(value) << SPI_IXS_BRG_BRG_Pos)) /* Assigment of value for BRG in the SPI_IXS_BRG register */
#define SPI_IXS_BRG_Msk                       _UINT32_(0x00001FFF)                                 /* (SPI_IXS_BRG) Register Mask  */


/* -------- SPI_IXS_DBGCTRL : (SPI_IXS Offset: 0x30) (R/W 32) SPI Debug Control Register -------- */
#define SPI_IXS_DBGCTRL_RESETVALUE            _UINT32_(0x00)                                       /*  (SPI_IXS_DBGCTRL) SPI Debug Control Register  Reset Value */

#define SPI_IXS_DBGCTRL_DBGRUN_Pos            _UINT32_(0)                                          /* (SPI_IXS_DBGCTRL) Debug Running State Position */
#define SPI_IXS_DBGCTRL_DBGRUN_Msk            (_UINT32_(0x1) << SPI_IXS_DBGCTRL_DBGRUN_Pos)        /* (SPI_IXS_DBGCTRL) Debug Running State Mask */
#define SPI_IXS_DBGCTRL_DBGRUN(value)         (SPI_IXS_DBGCTRL_DBGRUN_Msk & (_UINT32_(value) << SPI_IXS_DBGCTRL_DBGRUN_Pos)) /* Assigment of value for DBGRUN in the SPI_IXS_DBGCTRL register */
#define SPI_IXS_DBGCTRL_Msk                   _UINT32_(0x00000001)                                 /* (SPI_IXS_DBGCTRL) Register Mask  */


/* -------- SPI_IXS_SYNCBUSY : (SPI_IXS Offset: 0x34) ( R/ 32) SPI Sync Busy Register -------- */
#define SPI_IXS_SYNCBUSY_RESETVALUE           _UINT32_(0x00)                                       /*  (SPI_IXS_SYNCBUSY) SPI Sync Busy Register  Reset Value */

#define SPI_IXS_SYNCBUSY_SWRSTBSY_Pos         _UINT32_(0)                                          /* (SPI_IXS_SYNCBUSY) Software reset busy bit   --- Synchronizing Busy bit for swrst Position */
#define SPI_IXS_SYNCBUSY_SWRSTBSY_Msk         (_UINT32_(0x1) << SPI_IXS_SYNCBUSY_SWRSTBSY_Pos)     /* (SPI_IXS_SYNCBUSY) Software reset busy bit   --- Synchronizing Busy bit for swrst Mask */
#define SPI_IXS_SYNCBUSY_SWRSTBSY(value)      (SPI_IXS_SYNCBUSY_SWRSTBSY_Msk & (_UINT32_(value) << SPI_IXS_SYNCBUSY_SWRSTBSY_Pos)) /* Assigment of value for SWRSTBSY in the SPI_IXS_SYNCBUSY register */
#define SPI_IXS_SYNCBUSY_Msk                  _UINT32_(0x00000001)                                 /* (SPI_IXS_SYNCBUSY) Register Mask  */


/* -------- SPI_IXS_EVCTRL : (SPI_IXS Offset: 0x38) (R/W 32) SPI Event Control Register -------- */
#define SPI_IXS_EVCTRL_RESETVALUE             _UINT32_(0x00)                                       /*  (SPI_IXS_EVCTRL) SPI Event Control Register  Reset Value */

#define SPI_IXS_EVCTRL_FPSEEN_Pos             _UINT32_(0)                                          /* (SPI_IXS_EVCTRL) Frame Pulse Event Enable Bit Position */
#define SPI_IXS_EVCTRL_FPSEEN_Msk             (_UINT32_(0x1) << SPI_IXS_EVCTRL_FPSEEN_Pos)         /* (SPI_IXS_EVCTRL) Frame Pulse Event Enable Bit Mask */
#define SPI_IXS_EVCTRL_FPSEEN(value)          (SPI_IXS_EVCTRL_FPSEEN_Msk & (_UINT32_(value) << SPI_IXS_EVCTRL_FPSEEN_Pos)) /* Assigment of value for FPSEEN in the SPI_IXS_EVCTRL register */
#define SPI_IXS_EVCTRL_Msk                    _UINT32_(0x00000001)                                 /* (SPI_IXS_EVCTRL) Register Mask  */


/** \brief SPI_IXS register offsets definitions */
#define SPI_IXS_CTRLA_REG_OFST         _UINT32_(0x00)      /* (SPI_IXS_CTRLA) SPI Control Enable Register Offset */
#define SPI_IXS_SELCTRL_REG_OFST       _UINT32_(0x04)      /* (SPI_IXS_SELCTRL) SPI Control Options Select Register Offset */
#define SPI_IXS_SPICTRL_REG_OFST       _UINT32_(0x08)      /* (SPI_IXS_SPICTRL) SPI Control Register Offset */
#define SPI_IXS_FRAMECTRL_REG_OFST     _UINT32_(0x0C)      /* (SPI_IXS_FRAMECTRL) SPI Control Frame Register Offset */
#define SPI_IXS_AUDCTRL_REG_OFST       _UINT32_(0x10)      /* (SPI_IXS_AUDCTRL) SPI Control Audio Register Offset */
#define SPI_IXS_TPDCTRL_REG_OFST       _UINT32_(0x14)      /* (SPI_IXS_TPDCTRL) SPI Control Tpd Register Offset */
#define SPI_IXS_INTENSET_REG_OFST      _UINT32_(0x18)      /* (SPI_IXS_INTENSET) SPI Interrupt Enable Set Register Offset */
#define SPI_IXS_INTENCLR_REG_OFST      _UINT32_(0x1C)      /* (SPI_IXS_INTENCLR) SPI Interrupt Enable Clear Register Offset */
#define SPI_IXS_INTFLAG_REG_OFST       _UINT32_(0x20)      /* (SPI_IXS_INTFLAG) SPI Interrupt Flag Register Offset */
#define SPI_IXS_STATUS_REG_OFST        _UINT32_(0x24)      /* (SPI_IXS_STATUS) SPI Status Register Offset */
#define SPI_IXS_BUF_REG_OFST           _UINT32_(0x28)      /* (SPI_IXS_BUF) SPI Buffer Register Offset */
#define SPI_IXS_BRG_REG_OFST           _UINT32_(0x2C)      /* (SPI_IXS_BRG) SPI Baud Rate Register Offset */
#define SPI_IXS_DBGCTRL_REG_OFST       _UINT32_(0x30)      /* (SPI_IXS_DBGCTRL) SPI Debug Control Register Offset */
#define SPI_IXS_SYNCBUSY_REG_OFST      _UINT32_(0x34)      /* (SPI_IXS_SYNCBUSY) SPI Sync Busy Register Offset */
#define SPI_IXS_EVCTRL_REG_OFST        _UINT32_(0x38)      /* (SPI_IXS_EVCTRL) SPI Event Control Register Offset */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SPI_IXS register API structure */
typedef struct
{  /* Audio SPI with 8 channels compatibilty */
  __IO  uint32_t                       SPI_IXS_CTRLA;      /**< Offset: 0x00 (R/W  32) SPI Control Enable Register */
  __IO  uint32_t                       SPI_IXS_SELCTRL;    /**< Offset: 0x04 (R/W  32) SPI Control Options Select Register */
  __IO  uint32_t                       SPI_IXS_SPICTRL;    /**< Offset: 0x08 (R/W  32) SPI Control Register */
  __IO  uint32_t                       SPI_IXS_FRAMECTRL;  /**< Offset: 0x0C (R/W  32) SPI Control Frame Register */
  __IO  uint32_t                       SPI_IXS_AUDCTRL;    /**< Offset: 0x10 (R/W  32) SPI Control Audio Register */
  __IO  uint32_t                       SPI_IXS_TPDCTRL;    /**< Offset: 0x14 (R/W  32) SPI Control Tpd Register */
  __IO  uint32_t                       SPI_IXS_INTENSET;   /**< Offset: 0x18 (R/W  32) SPI Interrupt Enable Set Register */
  __IO  uint32_t                       SPI_IXS_INTENCLR;   /**< Offset: 0x1C (R/W  32) SPI Interrupt Enable Clear Register */
  __IO  uint32_t                       SPI_IXS_INTFLAG;    /**< Offset: 0x20 (R/W  32) SPI Interrupt Flag Register */
  __I   uint32_t                       SPI_IXS_STATUS;     /**< Offset: 0x24 (R/   32) SPI Status Register */
  __IO  uint32_t                       SPI_IXS_BUF;        /**< Offset: 0x28 (R/W  32) SPI Buffer Register */
  __IO  uint32_t                       SPI_IXS_BRG;        /**< Offset: 0x2C (R/W  32) SPI Baud Rate Register */
  __IO  uint32_t                       SPI_IXS_DBGCTRL;    /**< Offset: 0x30 (R/W  32) SPI Debug Control Register */
  __I   uint32_t                       SPI_IXS_SYNCBUSY;   /**< Offset: 0x34 (R/   32) SPI Sync Busy Register */
  __IO  uint32_t                       SPI_IXS_EVCTRL;     /**< Offset: 0x38 (R/W  32) SPI Event Control Register */
} spi_ixs_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CZCA80_SPI_IXS_COMPONENT_H_ */
